//-----------------------------------------------------------------------------
// @brief  障害物：動かない.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------
#include "ObstructStatic.h"

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
ObstructStatic::ObstructStatic(int handle) : 
	ObstructBase(handle)
{
	//// ３Ｄモデルの読み込み
	//modelHandle = MV1DuplicateModel(handle);
	//if (modelHandle < 0)
	//{
	//	printfDx("ObstructStatic:データ読み込みに失敗");
	//}

	//pos = VGet(0, 0, 0);
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
ObstructStatic::~ObstructStatic()
{
	// モデルのアンロード.
	MV1DeleteModel(modelHandle);
}
